In [8]:
from sklearn.linear_model import LinearRegression
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [9]:
data=pd.read_csv('../src/datasets/ecom-expense/Ecom Expense.csv')
data.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485

In [10]:
# Crear Dummies variables
dummy_gender=pd.get_dummies(data['Gender'], prefix="Gender")
dummy_city_tier=pd.get_dummies(data['City Tier'], prefix='City')
dummy_city_tier

      City_Tier 1  City_Tier 2  City_Tier 3
0               1            0            0
1               0            1            0
2               0            1            0
3               1            0            0
4               0            1            0
...           ...          ...          ...
2357            0            1            0
2358            0            1            0
2359            0            0            1
2360            1            0            0
2361            1            0            0

[2362 rows x 3 columns]

In [12]:
columns_names=data.columns.values.tolist()
# Unir columnas de Gender
df_new=data[columns_names].join(dummy_gender)

In [13]:
#Crear nuevo vector con nuevas columnas incluidas Gender con Tiers
columns_names2=df_new.columns.values.tolist()
df_new=df_new[columns_names2].join(dummy_city_tier)
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0

In [14]:
#DEfinir las variables que dependera el modelo
feature_cols=['Monthly Income', 'Transaction Time', 
              'Gender_Female', 'Gender_Male', 
              'City_Tier 1', 'City_Tier 2', 'City_Tier 3',
              'Record' 
             ]

In [15]:
X=df_new[feature_cols]
Y=df_new['Total Spend']

In [16]:
lm= LinearRegression()
lm.fit(X,Y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [17]:
print(lm.intercept_)
print(lm.coef_)

-79.4171303013718
[ 1.47538980e-01  1.54946125e-01 -1.31025013e+02  1.31025013e+02
  7.67643260e+01  5.51389743e+01 -1.31903300e+02  7.72233446e+02]

In [18]:
a=list(zip(feature_cols, lm.coef_))
a

[('Monthly Income', 0.14753898049205738),
 ('Transaction Time', 0.15494612549589634),
 ('Gender_Female', -131.02501325554624),
 ('Gender_Male', 131.02501325554607),
 ('City_Tier 1', 76.76432601049513),
 ('City_Tier 2', 55.1389743092325),
 ('City_Tier 3', -131.9033003197277),
 ('Record', 772.2334457445645)]

In [19]:
# R^2
lm.score(X,Y)

0.9179923586131016

## El modelo puede ser escrito como

* Total  Spend=  -79.4171303013718  +  0.14753898049205738*'Monthly Income' +  0.15494612549589634*'Transaction Time' --131.02501325554624* 'Gender_Female' + 131.02501325554607* 'Gender_Male' + 76.76432601049513* 'City_Tier 1' + 55.1389743092325*'City_Tier 2' -131.9033003197277*'City_Tier 3' +772.2334457445645*'Record'

In [20]:
df_new['prediction']=  (-79.4171303013718)  +  df_new['Monthly Income'] * 0.14753898049205738 +0.15494612549589634 * df_new['Transaction Time'] +(-131.02501325554624) * df_new['Gender_Female']+  131.02501325554607 * df_new['Gender_Male'] + 76.76432601049513 * df_new['City_Tier 1'] + 55.1389743092325 *df_new['City_Tier 2'] + (-131.9033003197277) * df_new['City_Tier 3'] + 772.2334457445645 * df_new['Record']
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3,prediction
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0,4903.696720
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0,4799.434826
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0,5157.082504
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0,8068.012996
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0,3581.980335

In [27]:
SSD=np.sum((df_new['prediction']-df_new['Total Spend'])**2)

RSE=np.sqrt(SSD/(len(df_new)-len(feature_cols)-1))
RSE

803.1318809818165

In [28]:
sales_mean=np.mean(df_new['Total Spend'])
sales_mean

6163.176415976714

In [29]:
error=RSE/sales_mean
error

0.13031135680294162